{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_10", "layers": [{"name": "Inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "name": "Inputs"}, "inbound_nodes": []}, {"name": "embedding_19", "class_name": "Embedding", "config": {"name": "embedding_19", "trainable": false, "batch_input_shape": [null, 30], "dtype": "float32", "input_dim": 3065, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 30}, "inbound_nodes": [[["Inputs", 0, 0, {}]]]}, {"name": "embedding_20", "class_name": "Embedding", "config": {"name": "embedding_20", "trainable": true, "batch_input_shape": [null, 30], "dtype": "float32", "input_dim": 3065, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 30}, "inbound_nodes": [[["Inputs", 0, 0, {}]]]}, {"name": "conv1d_55", "class_name": "Conv1D", "config": {"name": "conv1d_55", "trainable": true, "filters": 512, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_19", 0, 0, {}]]]}, {"name": "conv1d_56", "class_name": "Conv1D", "config": {"name": "conv1d_56", "trainable": true, "filters": 512, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_19", 0, 0, {}]]]}, {"name": "conv1d_57", "class_name": "Conv1D", "config": {"name": "conv1d_57", "trainable": true, "filters": 512, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_19", 0, 0, {}]]]}, {"name": "conv1d_58", "class_name": "Conv1D", "config": {"name": "conv1d_58", "trainable": true, "filters": 512, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_20", 0, 0, {}]]]}, {"name": "conv1d_59", "class_name": "Conv1D", "config": {"name": "conv1d_59", "trainable": true, "filters": 512, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_20", 0, 0, {}]]]}, {"name": "conv1d_60", "class_name": "Conv1D", "config": {"name": "conv1d_60", "trainable": true, "filters": 512, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_20", 0, 0, {}]]]}, {"name": "batch_normalization_55", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_55", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_55", 0, 0, {}]]]}, {"name": "batch_normalization_56", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_56", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_56", 0, 0, {}]]]}, {"name": "batch_normalization_57", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_57", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_57", 0, 0, {}]]]}, {"name": "batch_normalization_58", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_58", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_58", 0, 0, {}]]]}, {"name": "batch_normalization_59", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_59", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_59", 0, 0, {}]]]}, {"name": "batch_normalization_60", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_60", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_60", 0, 0, {}]]]}, {"name": "max_pooling1d_55", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_55", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_55", 0, 0, {}]]]}, {"name": "max_pooling1d_56", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_56", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_56", 0, 0, {}]]]}, {"name": "max_pooling1d_57", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_57", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_57", 0, 0, {}]]]}, {"name": "max_pooling1d_58", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_58", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_58", 0, 0, {}]]]}, {"name": "max_pooling1d_59", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_59", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_59", 0, 0, {}]]]}, {"name": "max_pooling1d_60", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_60", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_60", 0, 0, {}]]]}, {"name": "flatten_55", "class_name": "Flatten", "config": {"name": "flatten_55", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_55", 0, 0, {}]]]}, {"name": "flatten_56", "class_name": "Flatten", "config": {"name": "flatten_56", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_56", 0, 0, {}]]]}, {"name": "flatten_57", "class_name": "Flatten", "config": {"name": "flatten_57", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_57", 0, 0, {}]]]}, {"name": "flatten_58", "class_name": "Flatten", "config": {"name": "flatten_58", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_58", 0, 0, {}]]]}, {"name": "flatten_59", "class_name": "Flatten", "config": {"name": "flatten_59", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_59", 0, 0, {}]]]}, {"name": "flatten_60", "class_name": "Flatten", "config": {"name": "flatten_60", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_60", 0, 0, {}]]]}, {"name": "concatenate_28", "class_name": "Concatenate", "config": {"name": "concatenate_28", "trainable": true, "axis": 1}, "inbound_nodes": [[["flatten_55", 0, 0, {}], ["flatten_56", 0, 0, {}], ["flatten_57", 0, 0, {}]]]}, {"name": "concatenate_29", "class_name": "Concatenate", "config": {"name": "concatenate_29", "trainable": true, "axis": 1}, "inbound_nodes": [[["flatten_58", 0, 0, {}], ["flatten_59", 0, 0, {}], ["flatten_60", 0, 0, {}]]]}, {"name": "dropout_28", "class_name": "Dropout", "config": {"name": "dropout_28", "trainable": true, "rate": 0.5108356937892456, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_28", 0, 0, {}]]]}, {"name": "dropout_29", "class_name": "Dropout", "config": {"name": "dropout_29", "trainable": true, "rate": 0.44012240043070905, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_29", 0, 0, {}]]]}, {"name": "concatenate_30", "class_name": "Concatenate", "config": {"name": "concatenate_30", "trainable": true, "axis": 1}, "inbound_nodes": [[["dropout_28", 0, 0, {}], ["dropout_29", 0, 0, {}]]]}, {"name": "dropout_30", "class_name": "Dropout", "config": {"name": "dropout_30", "trainable": true, "rate": 0.8888716397829779, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_30", 0, 0, {}]]]}, {"name": "dense_10", "class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "units": 20, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_30", 0, 0, {}]]]}], "input_layers": [["Inputs", 0, 0]], "output_layers": [["dense_10", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of6", "group1-shard2of6", "group1-shard3of6", "group1-shard4of6", "group1-shard5of6", "group1-shard6of6"], "weights": [{"name": "batch_normalization_55/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_55/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_55/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_55/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_56/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_56/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_56/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_56/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_57/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_57/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_57/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_57/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_58/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_58/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_58/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_58/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_59/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_59/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_59/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_59/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_60/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_60/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_60/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_60/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv1d_55/kernel", "shape": [5, 300, 512], "dtype": "float32"}, {"name": "conv1d_55/bias", "shape": [512], "dtype": "float32"}, {"name": "conv1d_56/kernel", "shape": [4, 300, 512], "dtype": "float32"}, {"name": "conv1d_56/bias", "shape": [512], "dtype": "float32"}, {"name": "conv1d_57/kernel", "shape": [2, 300, 512], "dtype": "float32"}, {"name": "conv1d_57/bias", "shape": [512], "dtype": "float32"}, {"name": "conv1d_58/kernel", "shape": [2, 300, 512], "dtype": "float32"}, {"name": "conv1d_58/bias", "shape": [512], "dtype": "float32"}, {"name": "conv1d_59/kernel", "shape": [5, 300, 512], "dtype": "float32"}, {"name": "conv1d_59/bias", "shape": [512], "dtype": "float32"}, {"name": "conv1d_60/kernel", "shape": [5, 300, 512], "dtype": "float32"}, {"name": "conv1d_60/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_10/kernel", "shape": [40960, 20], "dtype": "float32"}, {"name": "dense_10/bias", "shape": [20], "dtype": "float32"}, {"name": "embedding_19/embeddings", "shape": [3065, 300], "dtype": "float32"}, {"name": "embedding_20/embeddings", "shape": [3065, 300], "dtype": "float32"}]}]}