{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_10", "layers": [{"name": "inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3065], "dtype": "float32", "sparse": false, "name": "inputs"}, "inbound_nodes": []}, {"name": "reshape_10", "class_name": "Reshape", "config": {"name": "reshape_10", "trainable": true, "target_shape": [1, 3065]}, "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"name": "lstm_28", "class_name": "LSTM", "config": {"name": "lstm_28", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 1024, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.6277159937533415, "recurrent_dropout": 0.9753057169923365, "implementation": 1}, "inbound_nodes": [[["reshape_10", 0, 0, {}]]]}, {"name": "lstm_29", "class_name": "LSTM", "config": {"name": "lstm_29", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.17025976545268018, "recurrent_dropout": 0.7657933635163517, "implementation": 1}, "inbound_nodes": [[["lstm_28", 0, 0, {}]]]}, {"name": "lstm_30", "class_name": "LSTM", "config": {"name": "lstm_30", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.7446290506725413, "recurrent_dropout": 0.12090219120950985, "implementation": 1}, "inbound_nodes": [[["lstm_29", 0, 0, {}]]]}, {"name": "dense_10", "class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "units": 20, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_30", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0]], "output_layers": [["dense_10", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.009999999776482582, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of17", "group1-shard2of17", "group1-shard3of17", "group1-shard4of17", "group1-shard5of17", "group1-shard6of17", "group1-shard7of17", "group1-shard8of17", "group1-shard9of17", "group1-shard10of17", "group1-shard11of17", "group1-shard12of17", "group1-shard13of17", "group1-shard14of17", "group1-shard15of17", "group1-shard16of17", "group1-shard17of17"], "weights": [{"name": "dense_10/kernel", "shape": [256, 20], "dtype": "float32"}, {"name": "dense_10/bias", "shape": [20], "dtype": "float32"}, {"name": "lstm_28/kernel", "shape": [3065, 4096], "dtype": "float32"}, {"name": "lstm_28/recurrent_kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "lstm_28/bias", "shape": [4096], "dtype": "float32"}, {"name": "lstm_29/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "lstm_29/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_29/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_30/kernel", "shape": [128, 1024], "dtype": "float32"}, {"name": "lstm_30/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_30/bias", "shape": [1024], "dtype": "float32"}]}]}