{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3065], "dtype": "float32", "sparse": false, "name": "inputs"}, "inbound_nodes": []}, {"name": "reshape_3", "class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "target_shape": [1, 3065]}, "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"name": "lstm_11", "class_name": "LSTM", "config": {"name": "lstm_11", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 1024, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.41152701144688464, "recurrent_dropout": 0.09787931878720435, "implementation": 1}, "inbound_nodes": [[["reshape_3", 0, 0, {}]]]}, {"name": "lstm_12", "class_name": "LSTM", "config": {"name": "lstm_12", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.30567409873485496, "recurrent_dropout": 0.04864354429440787, "implementation": 1}, "inbound_nodes": [[["lstm_11", 0, 0, {}]]]}, {"name": "lstm_13", "class_name": "LSTM", "config": {"name": "lstm_13", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.6357875518823483, "recurrent_dropout": 0.4700001460504394, "implementation": 1}, "inbound_nodes": [[["lstm_12", 0, 0, {}]]]}, {"name": "lstm_14", "class_name": "LSTM", "config": {"name": "lstm_14", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.6361810169483325, "recurrent_dropout": 0.7114247520786349, "implementation": 1}, "inbound_nodes": [[["lstm_13", 0, 0, {}]]]}, {"name": "lstm_15", "class_name": "LSTM", "config": {"name": "lstm_15", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5623815057565213, "recurrent_dropout": 0.3949936266626689, "implementation": 1}, "inbound_nodes": [[["lstm_14", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 20, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_15", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0]], "output_layers": [["dense_3", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.009999999776482582, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of21", "group1-shard2of21", "group1-shard3of21", "group1-shard4of21", "group1-shard5of21", "group1-shard6of21", "group1-shard7of21", "group1-shard8of21", "group1-shard9of21", "group1-shard10of21", "group1-shard11of21", "group1-shard12of21", "group1-shard13of21", "group1-shard14of21", "group1-shard15of21", "group1-shard16of21", "group1-shard17of21", "group1-shard18of21", "group1-shard19of21", "group1-shard20of21", "group1-shard21of21"], "weights": [{"name": "dense_3/kernel", "shape": [256, 20], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [20], "dtype": "float32"}, {"name": "lstm_11/kernel", "shape": [3065, 4096], "dtype": "float32"}, {"name": "lstm_11/recurrent_kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "lstm_11/bias", "shape": [4096], "dtype": "float32"}, {"name": "lstm_12/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "lstm_12/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_12/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_13/kernel", "shape": [128, 2048], "dtype": "float32"}, {"name": "lstm_13/recurrent_kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "lstm_13/bias", "shape": [2048], "dtype": "float32"}, {"name": "lstm_14/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "lstm_14/recurrent_kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "lstm_14/bias", "shape": [2048], "dtype": "float32"}, {"name": "lstm_15/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "lstm_15/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_15/bias", "shape": [1024], "dtype": "float32"}]}]}