{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_6", "layers": [{"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "name": "input_6"}, "inbound_nodes": []}, {"name": "embedding_6", "class_name": "Embedding", "config": {"name": "embedding_6", "trainable": true, "batch_input_shape": [null, 30], "dtype": "float32", "input_dim": 3065, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 30}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "lambda_6", "class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oEbWVhbikB2gF4qQByBgAAAPosL2hvbWUvZG1iL2tzdy9hbW9yZV9pbnRlcm5zaGlwL3Rl\nbXBfbW9kZWwucHnaCDxsYW1iZGE+hAAAAHMAAAAA\n", null, null], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxgAAAB8AGQBGQBkAmYCfABkA2QAhQIZABcAUwApBE7pAAAA\nAOkBAAAA6QIAAACpACkB2gVzaGFwZXIEAAAAcgQAAAD6LC9ob21lL2RtYi9rc3cvYW1vcmVfaW50\nZXJuc2hpcC90ZW1wX21vZGVsLnB52gg8bGFtYmRhPoUAAABzAAAAAA==\n", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["embedding_6", 0, 0, {}]]]}, {"name": "reshape_6", "class_name": "Reshape", "config": {"name": "reshape_6", "trainable": true, "target_shape": [1, 300]}, "inbound_nodes": [[["lambda_6", 0, 0, {}]]]}, {"name": "lstm_26", "class_name": "LSTM", "config": {"name": "lstm_26", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.37137668062177975, "recurrent_dropout": 0.8690420675326953, "implementation": 1}, "inbound_nodes": [[["reshape_6", 0, 0, {}]]]}, {"name": "lstm_27", "class_name": "LSTM", "config": {"name": "lstm_27", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5835529575912072, "recurrent_dropout": 0.7711868393049875, "implementation": 1}, "inbound_nodes": [[["lstm_26", 0, 0, {}]]]}, {"name": "lstm_28", "class_name": "LSTM", "config": {"name": "lstm_28", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5230545623611381, "recurrent_dropout": 0.9279163176452218, "implementation": 1}, "inbound_nodes": [[["lstm_27", 0, 0, {}]]]}, {"name": "lstm_29", "class_name": "LSTM", "config": {"name": "lstm_29", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 1024, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.8870945391821253, "recurrent_dropout": 0.20523925592349268, "implementation": 1}, "inbound_nodes": [[["lstm_28", 0, 0, {}]]]}, {"name": "lstm_30", "class_name": "LSTM", "config": {"name": "lstm_30", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.4267185046554288, "recurrent_dropout": 0.9524289077567939, "implementation": 1}, "inbound_nodes": [[["lstm_29", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "units": 20, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_30", 0, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["dense_6", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of16", "group1-shard2of16", "group1-shard3of16", "group1-shard4of16", "group1-shard5of16", "group1-shard6of16", "group1-shard7of16", "group1-shard8of16", "group1-shard9of16", "group1-shard10of16", "group1-shard11of16", "group1-shard12of16", "group1-shard13of16", "group1-shard14of16", "group1-shard15of16", "group1-shard16of16"], "weights": [{"name": "dense_6/kernel", "shape": [512, 20], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [20], "dtype": "float32"}, {"name": "embedding_6/embeddings", "shape": [3065, 300], "dtype": "float32"}, {"name": "lstm_26/kernel", "shape": [300, 2048], "dtype": "float32"}, {"name": "lstm_26/recurrent_kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "lstm_26/bias", "shape": [2048], "dtype": "float32"}, {"name": "lstm_27/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "lstm_27/recurrent_kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "lstm_27/bias", "shape": [2048], "dtype": "float32"}, {"name": "lstm_28/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "lstm_28/recurrent_kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "lstm_28/bias", "shape": [2048], "dtype": "float32"}, {"name": "lstm_29/kernel", "shape": [512, 4096], "dtype": "float32"}, {"name": "lstm_29/recurrent_kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "lstm_29/bias", "shape": [4096], "dtype": "float32"}, {"name": "lstm_30/kernel", "shape": [1024, 2048], "dtype": "float32"}, {"name": "lstm_30/recurrent_kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "lstm_30/bias", "shape": [2048], "dtype": "float32"}]}]}