{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_10", "layers": [{"name": "inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3065], "dtype": "float32", "sparse": false, "name": "inputs"}, "inbound_nodes": []}, {"name": "dense_46", "class_name": "Dense", "config": {"name": "dense_46", "trainable": true, "units": 2048, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"name": "batch_normalization_37", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_37", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dense_46", 0, 0, {}]]]}, {"name": "dropout_37", "class_name": "Dropout", "config": {"name": "dropout_37", "trainable": true, "rate": 0.9753057169923365, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]]}, {"name": "dense_47", "class_name": "Dense", "config": {"name": "dense_47", "trainable": true, "units": 2048, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_37", 0, 0, {}]]]}, {"name": "batch_normalization_38", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_38", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dense_47", 0, 0, {}]]]}, {"name": "dropout_38", "class_name": "Dropout", "config": {"name": "dropout_38", "trainable": true, "rate": 0.17025976545268018, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_38", 0, 0, {}]]]}, {"name": "dense_48", "class_name": "Dense", "config": {"name": "dense_48", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_38", 0, 0, {}]]]}, {"name": "batch_normalization_39", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_39", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dense_48", 0, 0, {}]]]}, {"name": "dropout_39", "class_name": "Dropout", "config": {"name": "dropout_39", "trainable": true, "rate": 0.7657933635163517, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_39", 0, 0, {}]]]}, {"name": "dense_49", "class_name": "Dense", "config": {"name": "dense_49", "trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_39", 0, 0, {}]]]}, {"name": "batch_normalization_40", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_40", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dense_49", 0, 0, {}]]]}, {"name": "dropout_40", "class_name": "Dropout", "config": {"name": "dropout_40", "trainable": true, "rate": 0.7446290506725413, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_40", 0, 0, {}]]]}, {"name": "dense_50", "class_name": "Dense", "config": {"name": "dense_50", "trainable": true, "units": 20, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_40", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0]], "output_layers": [["dense_50", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of11", "group1-shard2of11", "group1-shard3of11", "group1-shard4of11", "group1-shard5of11", "group1-shard6of11", "group1-shard7of11", "group1-shard8of11", "group1-shard9of11", "group1-shard10of11", "group1-shard11of11"], "weights": [{"name": "batch_normalization_37/gamma", "shape": [2048], "dtype": "float32"}, {"name": "batch_normalization_37/beta", "shape": [2048], "dtype": "float32"}, {"name": "batch_normalization_37/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "batch_normalization_37/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "batch_normalization_38/gamma", "shape": [2048], "dtype": "float32"}, {"name": "batch_normalization_38/beta", "shape": [2048], "dtype": "float32"}, {"name": "batch_normalization_38/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "batch_normalization_38/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "batch_normalization_39/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_40/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_40/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_40/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_40/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "dense_46/kernel", "shape": [3065, 2048], "dtype": "float32"}, {"name": "dense_46/bias", "shape": [2048], "dtype": "float32"}, {"name": "dense_47/kernel", "shape": [2048, 2048], "dtype": "float32"}, {"name": "dense_47/bias", "shape": [2048], "dtype": "float32"}, {"name": "dense_48/kernel", "shape": [2048, 256], "dtype": "float32"}, {"name": "dense_48/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_49/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "dense_49/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_50/kernel", "shape": [512, 20], "dtype": "float32"}, {"name": "dense_50/bias", "shape": [20], "dtype": "float32"}]}]}