{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3065], "dtype": "float32", "sparse": false, "name": "inputs"}, "inbound_nodes": []}, {"name": "dense_9", "class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dense_9", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.7114247520786349, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "dense_10", "class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dense_10", 0, 0, {}]]]}, {"name": "dropout_8", "class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "rate": 0.5623815057565213, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "dense_11", "class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"name": "dropout_9", "class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "rate": 0.3949936266626689, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "dense_12", "class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "units": 20, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0]], "output_layers": [["dense_12", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of5", "group1-shard2of5", "group1-shard3of5", "group1-shard4of5", "group1-shard5of5"], "weights": [{"name": "batch_normalization_7/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_9/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "dense_10/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "dense_10/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_11/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "dense_11/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_12/kernel", "shape": [512, 20], "dtype": "float32"}, {"name": "dense_12/bias", "shape": [20], "dtype": "float32"}, {"name": "dense_9/kernel", "shape": [3065, 1024], "dtype": "float32"}, {"name": "dense_9/bias", "shape": [1024], "dtype": "float32"}]}]}