{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "Inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "name": "Inputs"}, "inbound_nodes": []}, {"name": "embedding_13", "class_name": "Embedding", "config": {"name": "embedding_13", "trainable": false, "batch_input_shape": [null, 30], "dtype": "float32", "input_dim": 3065, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 30}, "inbound_nodes": [[["Inputs", 0, 0, {}]]]}, {"name": "embedding_14", "class_name": "Embedding", "config": {"name": "embedding_14", "trainable": true, "batch_input_shape": [null, 30], "dtype": "float32", "input_dim": 3065, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 30}, "inbound_nodes": [[["Inputs", 0, 0, {}]]]}, {"name": "conv1d_37", "class_name": "Conv1D", "config": {"name": "conv1d_37", "trainable": true, "filters": 256, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_13", 0, 0, {}]]]}, {"name": "conv1d_38", "class_name": "Conv1D", "config": {"name": "conv1d_38", "trainable": true, "filters": 256, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_13", 0, 0, {}]]]}, {"name": "conv1d_39", "class_name": "Conv1D", "config": {"name": "conv1d_39", "trainable": true, "filters": 256, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_13", 0, 0, {}]]]}, {"name": "conv1d_40", "class_name": "Conv1D", "config": {"name": "conv1d_40", "trainable": true, "filters": 256, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_14", 0, 0, {}]]]}, {"name": "conv1d_41", "class_name": "Conv1D", "config": {"name": "conv1d_41", "trainable": true, "filters": 256, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_14", 0, 0, {}]]]}, {"name": "conv1d_42", "class_name": "Conv1D", "config": {"name": "conv1d_42", "trainable": true, "filters": 256, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_14", 0, 0, {}]]]}, {"name": "batch_normalization_37", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_37", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_37", 0, 0, {}]]]}, {"name": "batch_normalization_38", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_38", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_38", 0, 0, {}]]]}, {"name": "batch_normalization_39", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_39", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_39", 0, 0, {}]]]}, {"name": "batch_normalization_40", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_40", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_40", 0, 0, {}]]]}, {"name": "batch_normalization_41", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_41", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_41", 0, 0, {}]]]}, {"name": "batch_normalization_42", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_42", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_42", 0, 0, {}]]]}, {"name": "max_pooling1d_37", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_37", "trainable": true, "strides": [3], "pool_size": [3], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]]}, {"name": "max_pooling1d_38", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_38", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_38", 0, 0, {}]]]}, {"name": "max_pooling1d_39", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_39", "trainable": true, "strides": [3], "pool_size": [3], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_39", 0, 0, {}]]]}, {"name": "max_pooling1d_40", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_40", "trainable": true, "strides": [3], "pool_size": [3], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_40", 0, 0, {}]]]}, {"name": "max_pooling1d_41", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_41", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_41", 0, 0, {}]]]}, {"name": "max_pooling1d_42", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_42", "trainable": true, "strides": [3], "pool_size": [3], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_42", 0, 0, {}]]]}, {"name": "flatten_37", "class_name": "Flatten", "config": {"name": "flatten_37", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_37", 0, 0, {}]]]}, {"name": "flatten_38", "class_name": "Flatten", "config": {"name": "flatten_38", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_38", 0, 0, {}]]]}, {"name": "flatten_39", "class_name": "Flatten", "config": {"name": "flatten_39", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_39", 0, 0, {}]]]}, {"name": "flatten_40", "class_name": "Flatten", "config": {"name": "flatten_40", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_40", 0, 0, {}]]]}, {"name": "flatten_41", "class_name": "Flatten", "config": {"name": "flatten_41", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_41", 0, 0, {}]]]}, {"name": "flatten_42", "class_name": "Flatten", "config": {"name": "flatten_42", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_42", 0, 0, {}]]]}, {"name": "concatenate_13", "class_name": "Concatenate", "config": {"name": "concatenate_13", "trainable": true, "axis": 1}, "inbound_nodes": [[["flatten_37", 0, 0, {}], ["flatten_38", 0, 0, {}], ["flatten_39", 0, 0, {}]]]}, {"name": "concatenate_14", "class_name": "Concatenate", "config": {"name": "concatenate_14", "trainable": true, "axis": 1}, "inbound_nodes": [[["flatten_40", 0, 0, {}], ["flatten_41", 0, 0, {}], ["flatten_42", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["concatenate_13", 0, 0, {}], ["concatenate_14", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.9553237496658106, "noise_shape": null, "seed": null}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "units": 20, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}], "input_layers": [["Inputs", 0, 0]], "output_layers": [["dense_7", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of4", "group1-shard2of4", "group1-shard3of4", "group1-shard4of4"], "weights": [{"name": "batch_normalization_37/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_37/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_37/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_37/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_38/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_38/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_38/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_38/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_40/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_40/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_40/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_40/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_41/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_41/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_41/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_41/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_42/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_42/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_42/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_42/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv1d_37/kernel", "shape": [2, 300, 256], "dtype": "float32"}, {"name": "conv1d_37/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_38/kernel", "shape": [5, 300, 256], "dtype": "float32"}, {"name": "conv1d_38/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_39/kernel", "shape": [4, 300, 256], "dtype": "float32"}, {"name": "conv1d_39/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_40/kernel", "shape": [2, 300, 256], "dtype": "float32"}, {"name": "conv1d_40/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_41/kernel", "shape": [5, 300, 256], "dtype": "float32"}, {"name": "conv1d_41/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_42/kernel", "shape": [4, 300, 256], "dtype": "float32"}, {"name": "conv1d_42/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [7936, 20], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [20], "dtype": "float32"}, {"name": "embedding_13/embeddings", "shape": [3065, 300], "dtype": "float32"}, {"name": "embedding_14/embeddings", "shape": [3065, 300], "dtype": "float32"}]}]}