{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3065], "dtype": "float32", "sparse": false, "name": "inputs"}, "inbound_nodes": []}, {"name": "reshape_7", "class_name": "Reshape", "config": {"name": "reshape_7", "trainable": true, "target_shape": [3065, 1]}, "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"name": "conv1d_19", "class_name": "Conv1D", "config": {"name": "conv1d_19", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_7", 0, 0, {}]]]}, {"name": "conv1d_20", "class_name": "Conv1D", "config": {"name": "conv1d_20", "trainable": true, "filters": 128, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_7", 0, 0, {}]]]}, {"name": "conv1d_21", "class_name": "Conv1D", "config": {"name": "conv1d_21", "trainable": true, "filters": 128, "kernel_size": [4], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_7", 0, 0, {}]]]}, {"name": "max_pooling1d_19", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_19", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["conv1d_19", 0, 0, {}]]]}, {"name": "max_pooling1d_20", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_20", "trainable": true, "strides": [3], "pool_size": [3], "padding": "valid"}, "inbound_nodes": [[["conv1d_20", 0, 0, {}]]]}, {"name": "max_pooling1d_21", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_21", "trainable": true, "strides": [3], "pool_size": [3], "padding": "valid"}, "inbound_nodes": [[["conv1d_21", 0, 0, {}]]]}, {"name": "flatten_19", "class_name": "Flatten", "config": {"name": "flatten_19", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_19", 0, 0, {}]]]}, {"name": "flatten_20", "class_name": "Flatten", "config": {"name": "flatten_20", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_20", 0, 0, {}]]]}, {"name": "flatten_21", "class_name": "Flatten", "config": {"name": "flatten_21", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling1d_21", 0, 0, {}]]]}, {"name": "concatenate_7", "class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "axis": 1}, "inbound_nodes": [[["flatten_19", 0, 0, {}], ["flatten_20", 0, 0, {}], ["flatten_21", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.7690051974625634, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "units": 20, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0]], "output_layers": [["dense_7", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of7", "group1-shard2of7", "group1-shard3of7", "group1-shard4of7", "group1-shard5of7", "group1-shard6of7", "group1-shard7of7"], "weights": [{"name": "conv1d_19/kernel", "shape": [2, 1, 64], "dtype": "float32"}, {"name": "conv1d_19/bias", "shape": [64], "dtype": "float32"}, {"name": "conv1d_20/kernel", "shape": [4, 1, 128], "dtype": "float32"}, {"name": "conv1d_20/bias", "shape": [128], "dtype": "float32"}, {"name": "conv1d_21/kernel", "shape": [4, 1, 128], "dtype": "float32"}, {"name": "conv1d_21/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [359168, 20], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [20], "dtype": "float32"}]}]}